Hey @thelizri ,

Did you do anything else in your setup?

I have the following:

```hcl
# foo/terragrunt.hcl

terraform {
  source = "../shared"
}

inputs = {
  output_dir = get_terragrunt_dir()
  content = "Hello from foo, Terragrunt!"
}
```

```hcl
# shared/main.tf

variable "content" {}
variable "output_dir" {}

resource "local_file" "file" {
  content  = var.content
  filename = "${var.output_dir}/hi.txt"
}

output "content" {
  value = local_file.file.content
}
```

```bash
$ terragrunt apply
10:54:41.583 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
10:54:41.584 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
10:54:41.584 STDOUT tofu:   + create
10:54:41.584 STDOUT tofu: OpenTofu will perform the following actions:
10:54:41.584 STDOUT tofu:   # local_file.file will be created
10:54:41.584 STDOUT tofu:   + resource "local_file" "file" {
10:54:41.584 STDOUT tofu:       + content              = "Hello from foo, Terragrunt!"
10:54:41.584 STDOUT tofu:       + content_base64sha256 = (known after apply)
10:54:41.584 STDOUT tofu:       + content_base64sha512 = (known after apply)
10:54:41.584 STDOUT tofu:       + content_md5          = (known after apply)
10:54:41.584 STDOUT tofu:       + content_sha1         = (known after apply)
10:54:41.584 STDOUT tofu:       + content_sha256       = (known after apply)
10:54:41.584 STDOUT tofu:       + content_sha512       = (known after apply)
10:54:41.584 STDOUT tofu:       + directory_permission = "0777"
10:54:41.584 STDOUT tofu:       + file_permission      = "0777"
10:54:41.584 STDOUT tofu:       + filename             = "./hi.txt"
10:54:41.584 STDOUT tofu:       + id                   = (known after apply)
10:54:41.584 STDOUT tofu:     }
10:54:41.584 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
10:54:41.584 STDOUT tofu:
10:54:41.584 STDOUT tofu: Changes to Outputs:
10:54:41.584 STDOUT tofu:   + content = "Hello from foo, Terragrunt!"
10:54:41.584 STDOUT tofu:
10:54:41.584 STDOUT tofu: Do you want to perform these actions?
10:54:41.584 STDOUT tofu:   OpenTofu will perform the actions described above.
10:54:41.584 STDOUT tofu:   Only 'yes' will be accepted to approve.
10:54:41.584 STDOUT tofu:   Enter a value:
yes
10:54:42.726 STDOUT tofu: local_file.file: Creating...
10:54:42.728 STDOUT tofu: local_file.file: Creation complete after 0s [id=c4ae21736a6297f44ea86791e528338e9d14a0e9]
10:54:42.742 STDOUT tofu:
10:54:42.742 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
10:54:42.742 STDOUT tofu:
10:54:42.742 STDOUT tofu: Outputs:
10:54:42.742 STDOUT tofu: content = "Hello from foo, Terragrunt!"
```

```bash
$ terragrunt output
content = "Hello from foo, Terragrunt!"
```

```bash
$ terragrunt --version
terragrunt version v0.87.5
```